{"courses":[{"title":"Angularr","price":"123","img":"ыыыыыыыыыыыыыыыыыы","id":"7789426c-0aab-456e-9a00-9529f726a4eb","count":5},{"title":"Vue.js","price":"1000","img":"В программировании переменная представляет собой некоторый контейнер в памяти компьютера, где хранятся данные. После того как данные сохранены, их можно вызвать, используя имя этой переменной. Программист может выбрать любое имя для переменной, за исключением ключевых слов языка Python. Лучше выбирать для переменных значащие имена, которые отражают их содержание. В программах Python данные, которые нужно хранить в переменных, вносятся с помощью оператора присваивания =, например, чтобы сохранить числовое значение 8 в переменной с именем a, нужно написать: a = 8 Затем можно обратиться к сохраненному значению переменной, используя ее имя. Таким образом, инструкция print( a ) выведет сохраненное значение 8. Переменным могут быть последовательно присвоены разные значения, и, следовательно, переменная способна принимать различные значения по мере работы программы — неслучайно она так и называется: переменная. В языке Python переменной должно быть присвоено начальное значение (инициализация переменной) в инструкции, которая объявляет эту переменную в программе, — иначе интерпретатор вызовет сообщение об ошибке not defined (неопределенная переменная) В одной инструкции разрешается инициализировать несколько переменных с одним значением. Это можно сделать, используя оператор присваивания =. Например, для инициализации переменных a, b и c и присваивания им значения 8 мы используем запись: a = b = c = 8 Наоборот, несколько переменных можно проинициализировать с различными значениями и записать все это в одной инструкции, используя запятую в качестве разделителя. Например, в качестве инициализации переменных a, b и c с числовыми значениями 1, 2, 3 мы используем запись: a, b, c = 1, 2, 3 Некоторые языки программирования, такие как Java, требуют указания типов переменных при их объявлении. При этом резервируется определенный объем памяти. Данный прием известен как статическая типизация. На переменные в языке Python такое ограничение не накладывается, и распределение памяти происходит в соответствии с присваиваемыми переменным значениями (динамическая типизация). Это означает, что переменная может содержать как целые числа, так и числа с плавающей точкой, текстовые строки или логические значения. Вы можете добавлять в свои программы на Python комментарии для описания инструкций или разделов кода. Для этого используется символ #. Все, что идет после этого символа до конца строки, игнорируется интерпретатором Python. Комментарии очень полезны — они помогают сделать ваш код понятным для других, а также для вас самих, когда вы позже к нему возвращаетесь. 1. Запустите текстовый редактор, в котором объявите и инициализируйте переменную, затем выведите хранящееся в ней значение. # Инициализируем переменную целочисленным значением var = 8 print( var ) 2. Затем присвойте новое значение переменной и выведите его на экран. # Присваиваем переменной значение числа с плавающей точкой var = 3.142 print( var ) 3. Теперь присваиваем другое значение и отображаем его опять. # Присваиваем переменной строковое значение var = 'Python in easy steps' print( var ) 4. Наконец присваиваем еще одно значение и снова выводим ре зультат. # Присваиваем переменной логическое значение var = True print( var ) 5. Сохраните файл в вашем рабочем каталоге, затем откройте командную строку из этого каталога и запустите программу, чтобы посмотреть результат ее вывода.","id":"ad5f0439-401e-4c40-ad4c-545170348603","count":1},{"title":"'<p>Корзина пуста</p>'","price":"1488","img":"https://upload.wikimedia.org/wikipedia/commons/thumb/c/c3/Python-logo-notext.svg/1200px-Python-logo-notext.svg.png","id":"9704096a-95ed-457b-9990-b9f5e392b253","count":2},{"title":"Dssdsd","price":"1212","img":"fwefwefewf","id":"87cf2072-4d93-4129-833b-9ea0e9ef08a7","count":2}],"price":7015}